# Taps
tap "ruimarinho/tap"

# CLI Tools
brew "gh"
brew "nvm"
brew "fzf"
brew "bat"
brew "zoxide"
brew "direnv"
brew "starship"

# Apps
cask "discord"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "postman"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "vlc"

# VS Code Extensions
vscode "anthropic.claude-code"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "kamikillerto.vscode-colorize"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "oliversturm.fix-json"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "yoavbls.pretty-ts-errors"
vscode "zignd.html-css-class-completion"
