# Taps
tap "ruimarinho/tap"

# CLI Tools
brew "docker-compose"
brew "gh"
brew "nvm"
brew "fzf"
brew "bat"
brew "zoxide"
brew "direnv"
brew "starship"

# Apps
cask "discord"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "postman"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "vlc"

# VS Code Extensions
vscode "alefragnani.bookmarks"
vscode "anthropic.claude-code"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "codesandbox-io.codesandbox-projects"
vscode "csstools.postcss"
vscode "d-koppenhagen.file-tree-to-text-generator"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "kamikillerto.vscode-colorize"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "oliversturm.fix-json"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-yaml"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "yoavbls.pretty-ts-errors"
vscode "zignd.html-css-class-completion"
