adpyke.codesnap
anthropic.claude-code
bradgashler.htmltagwrap
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
codesandbox-io.codesandbox-projects
csstools.postcss
d-koppenhagen.file-tree-to-text-generator
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
kamikillerto.vscode-colorize
mattpocock.ts-error-translator
mhutchie.git-graph
mikestead.dotenv
oliversturm.fix-json
pranaygp.vscode-css-peek
redhat.vscode-yaml
simonsiefke.svg-preview
streetsidesoftware.code-spell-checker
tomoki1207.pdf
vincaslt.highlight-matching-tag
vscode-icons-team.vscode-icons
yoavbls.pretty-ts-errors
zardoy.fix-all-json
zignd.html-css-class-completion
ziyasal.vscode-open-in-github
