alefragnani.bookmarks
anthropic.claude-code
bradgashler.htmltagwrap
bradlc.vscode-tailwindcss
codesandbox-io.codesandbox-projects
csstools.postcss
d-koppenhagen.file-tree-to-text-generator
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
enkia.tokyo-night
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
kamikillerto.vscode-colorize
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vsliveshare.vsliveshare
oliversturm.fix-json
pranaygp.vscode-css-peek
shardulm94.trailing-spaces
streetsidesoftware.code-spell-checker
vincaslt.highlight-matching-tag
vscode-icons-team.vscode-icons
wakatime.vscode-wakatime
yoavbls.pretty-ts-errors
zignd.html-css-class-completion
